{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "apiVersion": "2021-10-01-preview",
            "properties": {
                "displayName": "Detecting Login failure on both Linux and Windows - updated from github",
                "description": "",
                "severity": "Medium",
                "enabled": true,
                "query": "union LinuxFailedlogininvaliduser, Windowsfailedlogins\n//| where TargetUserName has \"test\"\n| project Activity, TargetUserName, Computer, IpAddress\n//| summarize count() by Activity, TargetUserName, Computer, IpAddress\n//| where count_ >= 4\n\n",
                "queryFrequency": "PT5H",
                "queryPeriod": "PT5H",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,
                "tactics": [],
                "techniques": [],
                "alertRuleTemplateName": null,
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": [],
                        "groupByCustomDetails": []
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "TargetUserName"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "HostName",
                                "columnName": "Computer"
                            }
                        ]
                    },
                    {
                        "entityType": "IP",
                        "fieldMappings": [
                            {
                                "identifier": "Address",
                                "columnName": "IpAddress"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null
            }
        },
        {
            "apiVersion": "2021-10-01-preview",
            "properties": {
                "displayName": "Detecting Login Failures Attempt on Windows Machine - updated from github",
                "description": "",
                "severity": "Medium",
                "enabled": true,
                "query": "SecurityEvent\n| where EventID == 4625\n| where TimeGenerated > ago(1h)\n//| join kind=inner _GetWatchlist('SecurimentUsers') on $left.TargetUserName == $right.TargetUserName\n| project\n    TimeGenerated,\n    EventID,\n    WorkstationName,\n    Computer,\n    TargetUserName,\n    LogonTypeName,\n    IpAddress\n//| extend IPEntity = IpAddress\n| summarize LoginFailure=count() by TargetUserName, Computer, IpAddress\n| where LoginFailure >= 4\n",
                "queryFrequency": "PT5M",
                "queryPeriod": "PT5M",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,
                "tactics": [
                    "CredentialAccess"
                ],
                "techniques": [
                    "T1110"
                ],
                "alertRuleTemplateName": null,
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": true,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [
                            "Account"
                        ],
                        "groupByAlertDetails": [],
                        "groupByCustomDetails": []
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "TargetUserName"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "HostName",
                                "columnName": "Computer"
                            }
                        ]
                    },
                    {
                        "entityType": "IP",
                        "fieldMappings": [
                            {
                                "identifier": "Address",
                                "columnName": "IpAddress"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null
            }
        },
        {
            "apiVersion": "2021-10-01-preview",
            "properties": {
                "displayName": "User login to Linux Machine - updated from github",
                "description": "Signin to Linux Server",
                "severity": "Medium",
                "enabled": true,
                "query": "Syslog\n| where Facility contains \"authpriv\"\n| where SyslogMessage contains \"Accepted password for\"\n",
                "queryFrequency": "PT15M",
                "queryPeriod": "PT15M",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,
                "tactics": [],
                "techniques": [],
                "alertRuleTemplateName": null,
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": true,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT15M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": [],
                        "groupByCustomDetails": []
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "AlertPerResult"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": null,
                "sentinelEntitiesMappings": null
            }
        },
        {
            
            "apiVersion": "2021-10-01-preview",
            "properties": {
                "ruleId": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/a96e3081-9170-47e8-9b45-6ac067264ccf')]",
                "triggerUri": "[listCallbackURL(concat('/subscriptions/dac2b6cb-7c07-4d09-bebe-2fcb017db92f/resourceGroups/securiment/providers/Microsoft.Logic/workflows/AddIndicatorsToWatchlist','/triggers/Microsoft_Sentinel_alert'),'2016-06-01').value]",
                "logicAppResourceId": "/subscriptions/dac2b6cb-7c07-4d09-bebe-2fcb017db92f/resourceGroups/securiment/providers/Microsoft.Logic/workflows/AddIndicatorsToWatchlist",
                "operatesOn": "Alert"
            },
            "dependsOn": [
                "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/a96e3081-9170-47e8-9b45-6ac067264ccf')]"
            ]
        },
        {
            
            "apiVersion": "2021-10-01-preview",
            "properties": {
                "ruleId": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/a204e71e-7f61-48b1-8050-3d1a7e082cd3')]",
                "triggerUri": "[listCallbackURL(concat('/subscriptions/dac2b6cb-7c07-4d09-bebe-2fcb017db92f/resourceGroups/securiment/providers/Microsoft.Logic/workflows/AddIndicatorsToWatchlist','/triggers/Microsoft_Sentinel_alert'),'2016-06-01').value]",
                "logicAppResourceId": "/subscriptions/dac2b6cb-7c07-4d09-bebe-2fcb017db92f/resourceGroups/securiment/providers/Microsoft.Logic/workflows/AddIndicatorsToWatchlist",
                "operatesOn": "Alert"
            },
            "dependsOn": [
                "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/a204e71e-7f61-48b1-8050-3d1a7e082cd3')]"
            ]
        },
        {
            
            "apiVersion": "2021-10-01-preview",
            "properties": {
                "ruleId": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/a204e71e-7f61-48b1-8050-3d1a7e082cd3')]",
                "triggerUri": "[listCallbackURL(concat('/subscriptions/dac2b6cb-7c07-4d09-bebe-2fcb017db92f/resourceGroups/securiment/providers/Microsoft.Logic/workflows/AddAnItemInWatchList','/triggers/When_a_response_to_an_Azure_Sentinel_alert_is_triggered'),'2016-06-01').value]",
                "logicAppResourceId": "/subscriptions/dac2b6cb-7c07-4d09-bebe-2fcb017db92f/resourceGroups/securiment/providers/Microsoft.Logic/workflows/AddAnItemInWatchList",
                "operatesOn": "Alert"
            },
            "dependsOn": [
                "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/a204e71e-7f61-48b1-8050-3d1a7e082cd3')]"
            ]
        },
        {
            
            "apiVersion": "2021-10-01-preview",
            "properties": {
                "ruleId": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/1c70f396-e950-4618-b429-0a7f000a6868')]",
                "triggerUri": "[listCallbackURL(concat('/subscriptions/dac2b6cb-7c07-4d09-bebe-2fcb017db92f/resourceGroups/securiment/providers/Microsoft.Logic/workflows/test-logicApp','/triggers/When_a_response_to_an_Azure_Sentinel_alert_is_triggered'),'2016-06-01').value]",
                "logicAppResourceId": "/subscriptions/dac2b6cb-7c07-4d09-bebe-2fcb017db92f/resourceGroups/securiment/providers/Microsoft.Logic/workflows/test-logicApp",
                "operatesOn": "Alert"
            },
            "dependsOn": [
                "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/1c70f396-e950-4618-b429-0a7f000a6868')]"
            ]
        }
    ]
}
